codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0032gpl036.h
extern volatile __CNCONBbits_t CNCONBbits __asm__ ("CNCONB") __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONBSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONBINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN0B __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIE0B0:1;
    unsigned CNIE0B1:1;
    unsigned CNIE0B2:1;
    unsigned CNIE0B3:1;
    unsigned CNIE0B4:1;
    unsigned CNIE0B5:1;
    unsigned CNIE0B6:1;
    unsigned CNIE0B7:1;
    unsigned CNIE0B8:1;
    unsigned CNIE0B9:1;
    unsigned CNIE0B10:1;
    unsigned CNIE0B11:1;
    unsigned CNIE0B12:1;
    unsigned CNIE0B13:1;
    unsigned CNIE0B14:1;
    unsigned CNIE0B15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNEN0Bbits_t;
extern volatile __CNEN0Bbits_t CNEN0Bbits __asm__ ("CNEN0B") __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN0BCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN0BSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN0BINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNSTATB0:1;
    unsigned CNSTATB1:1;
    unsigned CNSTATB2:1;
    unsigned CNSTATB3:1;
    unsigned CNSTATB4:1;
    unsigned CNSTATB5:1;
    unsigned CNSTATB6:1;
    unsigned CNSTATB7:1;
    unsigned CNSTATB8:1;
    unsigned CNSTATB9:1;
    unsigned CNSTATB10:1;
    unsigned CNSTATB11:1;
    unsigned CNSTATB12:1;
    unsigned CNSTATB13:1;
    unsigned CNSTATB14:1;
    unsigned CNSTATB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATBbits_t;
extern volatile __CNSTATBbits_t CNSTATBbits __asm__ ("CNSTATB") __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATBSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATBINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN1B __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIE1B0:1;
    unsigned CNIE1B1:1;
    unsigned CNIE1B2:1;
    unsigned CNIE1B3:1;
    unsigned CNIE1B4:1;
    unsigned CNIE1B5:1;
    unsigned CNIE1B6:1;
    unsigned CNIE1B7:1;
    unsigned CNIE1B8:1;
    unsigned CNIE1B9:1;
    unsigned CNIE1B10:1;
    unsigned CNIE1B11:1;
    unsigned CNIE1B12:1;
    unsigned CNIE1B13:1;
    unsigned CNIE1B14:1;
    unsigned CNIE1B15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNEN1Bbits_t;
extern volatile __CNEN1Bbits_t CNEN1Bbits __asm__ ("CNEN1B") __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN1BCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN1BSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNEN1BINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNFB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNFB0:1;
    unsigned CNFB1:1;
    unsigned CNFB2:1;
    unsigned CNFB3:1;
    unsigned CNFB4:1;
    unsigned CNFB5:1;
    unsigned CNFB6:1;
    unsigned CNFB7:1;
    unsigned CNFB8:1;
    unsigned CNFB9:1;
    unsigned CNFB10:1;
    unsigned CNFB11:1;
    unsigned CNFB12:1;
    unsigned CNFB13:1;
    unsigned CNFB14:1;
    unsigned CNFB15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNFBbits_t;
extern volatile __CNFBbits_t CNFBbits __asm__ ("CNFB") __attribute__((section("sfrs")));
extern volatile unsigned int        CNFBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNFBSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNFBINV __attribute__((section("sfrs")));
extern volatile unsigned int        SR0B __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned SR0B0:1;
    unsigned SR0B1:1;
    unsigned SR0B2:1;
    unsigned SR0B3:1;
    unsigned SR0B4:1;
    unsigned SR0B5:1;
    unsigned SR0B6:1;
    unsigned SR0B7:1;
    unsigned SR0B8:1;
    unsigned SR0B9:1;
    unsigned SR0B10:1;
    unsigned SR0B11:1;
    unsigned SR0B12:1;
    unsigned SR0B13:1;
    unsigned SR0B14:1;
    unsigned SR0B15:1;
  };
  struct {
    unsigned w:32;
  };
} __SR0Bbits_t;
extern volatile __SR0Bbits_t SR0Bbits __asm__ ("SR0B") __attribute__((section("sfrs")));
extern volatile unsigned int        SR0BCLR __attribute__((section("sfrs")));
extern volatile unsigned int        SR0BSET __attribute__((section("sfrs")));
extern volatile unsigned int        SR0BINV __attribute__((section("sfrs")));
extern volatile unsigned int        SR1B __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned SR1B0:1;
    unsigned SR1B1:1;
    unsigned SR1B2:1;
    unsigned SR1B3:1;
    unsigned SR1B4:1;
    unsigned SR1B5:1;
    unsigned SR1B6:1;
    unsigned SR1B7:1;
    unsigned SR1B8:1;
    unsigned SR1B9:1;
    unsigned SR1B10:1;
    unsigned SR1B11:1;
    unsigned SR1B12:1;
    unsigned SR1B13:1;
    unsigned SR1B14:1;
    unsigned SR1B15:1;
  };
  struct {
    unsigned w:32;
  };
} __SR1Bbits_t;
extern volatile __SR1Bbits_t SR1Bbits __asm__ ("SR1B") __attribute__((section("sfrs")));
extern volatile unsigned int        SR1BCLR __attribute__((section("sfrs")));
extern volatile unsigned int        SR1BSET __attribute__((section("sfrs")));
extern volatile unsigned int        SR1BINV __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ANSC0:1;
    unsigned ANSC1:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELCbits_t;
extern volatile __ANSELCbits_t ANSELCbits __asm__ ("ANSELC") __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELCCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELCSET __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELCINV __attribute__((section("sfrs")));
extern volatile unsigned int        TRISC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TRISC0:1;
    unsigned TRISC1:1;
    unsigned TRISC2:1;
    unsigned TRISC3:1;
    unsigned :4;
    unsigned TRISC8:1;
    unsigned TRISC9:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISCbits_t;
extern volatile __TRISCbits_t TRISCbits __asm__ ("TRISC") __attribute__((section("sfrs")));
extern volatile unsigned int        TRISCCLR __attribute__((section("sfrs")));
extern volatile unsigned int        TRISCSET __attribute__((section("sfrs")));
extern volatile unsigned int        TRISCINV __attribute__((section("sfrs")));
extern volatile unsigned int        PORTC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RC0:1;
    unsigned RC1:1;
    unsigned RC2:1;
    unsigned RC3:1;
    unsigned :4;
    unsigned RC8:1;
    unsigned RC9:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTCbits_t;
