codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0032gpl036.h
#define _CNSTATC_CNSTATC3_POSITION               0x00000003
#define _CNSTATC_CNSTATC3_MASK                   0x00000008
#define _CNSTATC_CNSTATC3_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC8_POSITION               0x00000008
#define _CNSTATC_CNSTATC8_MASK                   0x00000100
#define _CNSTATC_CNSTATC8_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC9_POSITION               0x00000009
#define _CNSTATC_CNSTATC9_MASK                   0x00000200
#define _CNSTATC_CNSTATC9_LENGTH                 0x00000001

#define _CNSTATC_w_POSITION                      0x00000000
#define _CNSTATC_w_MASK                          0xFFFFFFFF
#define _CNSTATC_w_LENGTH                        0x00000020

#define _CNEN1C_CNIE1C0_POSITION                 0x00000000
#define _CNEN1C_CNIE1C0_MASK                     0x00000001
#define _CNEN1C_CNIE1C0_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C1_POSITION                 0x00000001
#define _CNEN1C_CNIE1C1_MASK                     0x00000002
#define _CNEN1C_CNIE1C1_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C2_POSITION                 0x00000002
#define _CNEN1C_CNIE1C2_MASK                     0x00000004
#define _CNEN1C_CNIE1C2_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C3_POSITION                 0x00000003
#define _CNEN1C_CNIE1C3_MASK                     0x00000008
#define _CNEN1C_CNIE1C3_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C8_POSITION                 0x00000008
#define _CNEN1C_CNIE1C8_MASK                     0x00000100
#define _CNEN1C_CNIE1C8_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C9_POSITION                 0x00000009
#define _CNEN1C_CNIE1C9_MASK                     0x00000200
#define _CNEN1C_CNIE1C9_LENGTH                   0x00000001

#define _CNEN1C_w_POSITION                       0x00000000
#define _CNEN1C_w_MASK                           0xFFFFFFFF
#define _CNEN1C_w_LENGTH                         0x00000020

#define _CNFC_CNFC0_POSITION                     0x00000000
#define _CNFC_CNFC0_MASK                         0x00000001
#define _CNFC_CNFC0_LENGTH                       0x00000001

#define _CNFC_CNFC1_POSITION                     0x00000001
#define _CNFC_CNFC1_MASK                         0x00000002
#define _CNFC_CNFC1_LENGTH                       0x00000001

#define _CNFC_CNFC2_POSITION                     0x00000002
#define _CNFC_CNFC2_MASK                         0x00000004
#define _CNFC_CNFC2_LENGTH                       0x00000001

#define _CNFC_CNFC3_POSITION                     0x00000003
#define _CNFC_CNFC3_MASK                         0x00000008
#define _CNFC_CNFC3_LENGTH                       0x00000001

#define _CNFC_CNFC8_POSITION                     0x00000008
#define _CNFC_CNFC8_MASK                         0x00000100
#define _CNFC_CNFC8_LENGTH                       0x00000001

#define _CNFC_CNFC9_POSITION                     0x00000009
#define _CNFC_CNFC9_MASK                         0x00000200
#define _CNFC_CNFC9_LENGTH                       0x00000001

#define _CNFC_w_POSITION                         0x00000000
#define _CNFC_w_MASK                             0xFFFFFFFF
#define _CNFC_w_LENGTH                           0x00000020

#define _SR0C_SR0C0_POSITION                     0x00000000
#define _SR0C_SR0C0_MASK                         0x00000001
#define _SR0C_SR0C0_LENGTH                       0x00000001

#define _SR0C_SR0C1_POSITION                     0x00000001
#define _SR0C_SR0C1_MASK                         0x00000002
#define _SR0C_SR0C1_LENGTH                       0x00000001

#define _SR0C_SR0C2_POSITION                     0x00000002
#define _SR0C_SR0C2_MASK                         0x00000004
#define _SR0C_SR0C2_LENGTH                       0x00000001

#define _SR0C_SR0C3_POSITION                     0x00000003
#define _SR0C_SR0C3_MASK                         0x00000008
#define _SR0C_SR0C3_LENGTH                       0x00000001

#define _SR0C_SR0C8_POSITION                     0x00000008
#define _SR0C_SR0C8_MASK                         0x00000100
#define _SR0C_SR0C8_LENGTH                       0x00000001

#define _SR0C_SR0C9_POSITION                     0x00000009
#define _SR0C_SR0C9_MASK                         0x00000200
#define _SR0C_SR0C9_LENGTH                       0x00000001

#define _SR0C_w_POSITION                         0x00000000
#define _SR0C_w_MASK                             0xFFFFFFFF
#define _SR0C_w_LENGTH                           0x00000020

#define _SR1C_SR1C0_POSITION                     0x00000000
#define _SR1C_SR1C0_MASK                         0x00000001
#define _SR1C_SR1C0_LENGTH                       0x00000001

#define _SR1C_SR1C1_POSITION                     0x00000001
#define _SR1C_SR1C1_MASK                         0x00000002
#define _SR1C_SR1C1_LENGTH                       0x00000001

#define _SR1C_SR1C2_POSITION                     0x00000002
#define _SR1C_SR1C2_MASK                         0x00000004
#define _SR1C_SR1C2_LENGTH                       0x00000001

#define _SR1C_SR1C3_POSITION                     0x00000003
#define _SR1C_SR1C3_MASK                         0x00000008
#define _SR1C_SR1C3_LENGTH                       0x00000001

#define _SR1C_SR1C8_POSITION                     0x00000008
#define _SR1C_SR1C8_MASK                         0x00000100
#define _SR1C_SR1C8_LENGTH                       0x00000001

#define _SR1C_SR1C9_POSITION                     0x00000009
#define _SR1C_SR1C9_MASK                         0x00000200
#define _SR1C_SR1C9_LENGTH                       0x00000001

#define _SR1C_w_POSITION                         0x00000000
#define _SR1C_w_MASK                             0xFFFFFFFF
#define _SR1C_w_LENGTH                           0x00000020

#define _PMDCON_PMDLOCK_POSITION                 0x0000000B
#define _PMDCON_PMDLOCK_MASK                     0x00000800
#define _PMDCON_PMDLOCK_LENGTH                   0x00000001

#define _PMD1_ADCMD_POSITION                     0x00000000
#define _PMD1_ADCMD_MASK                         0x00000001
#define _PMD1_ADCMD_LENGTH                       0x00000001

