codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0032gpl036.h
#define _IFS0_U1EIF_POSITION                     0x00000019
#define _IFS0_U1EIF_MASK                         0x02000000
#define _IFS0_U1EIF_LENGTH                       0x00000001

#define _IFS0_I2C1SIF_POSITION                   0x0000001A
#define _IFS0_I2C1SIF_MASK                       0x04000000
#define _IFS0_I2C1SIF_LENGTH                     0x00000001

#define _IFS0_I2C1MIF_POSITION                   0x0000001B
#define _IFS0_I2C1MIF_MASK                       0x08000000
#define _IFS0_I2C1MIF_LENGTH                     0x00000001

#define _IFS0_I2C1BCIF_POSITION                  0x0000001C
#define _IFS0_I2C1BCIF_MASK                      0x10000000
#define _IFS0_I2C1BCIF_LENGTH                    0x00000001

#define _IFS0_CCP1IF_POSITION                    0x0000001D
#define _IFS0_CCP1IF_MASK                        0x20000000
#define _IFS0_CCP1IF_LENGTH                      0x00000001

#define _IFS0_CCT1IF_POSITION                    0x0000001E
#define _IFS0_CCT1IF_MASK                        0x40000000
#define _IFS0_CCT1IF_LENGTH                      0x00000001

#define _IFS0_CCP2IF_POSITION                    0x0000001F
#define _IFS0_CCP2IF_MASK                        0x80000000
#define _IFS0_CCP2IF_LENGTH                      0x00000001

#define _IFS0_w_POSITION                         0x00000000
#define _IFS0_w_MASK                             0xFFFFFFFF
#define _IFS0_w_LENGTH                           0x00000020

#define _IFS1_CCT2IF_POSITION                    0x00000000
#define _IFS1_CCT2IF_MASK                        0x00000001
#define _IFS1_CCT2IF_LENGTH                      0x00000001

#define _IFS1_CCP3IF_POSITION                    0x00000001
#define _IFS1_CCP3IF_MASK                        0x00000002
#define _IFS1_CCP3IF_LENGTH                      0x00000001

#define _IFS1_CCT3IF_POSITION                    0x00000002
#define _IFS1_CCT3IF_MASK                        0x00000004
#define _IFS1_CCT3IF_LENGTH                      0x00000001

#define _IFS1_SPI2EIF_POSITION                   0x00000005
#define _IFS1_SPI2EIF_MASK                       0x00000020
#define _IFS1_SPI2EIF_LENGTH                     0x00000001

#define _IFS1_SPI2TXIF_POSITION                  0x00000006
#define _IFS1_SPI2TXIF_MASK                      0x00000040
#define _IFS1_SPI2TXIF_LENGTH                    0x00000001

#define _IFS1_SPI2RXIF_POSITION                  0x00000007
#define _IFS1_SPI2RXIF_MASK                      0x00000080
#define _IFS1_SPI2RXIF_LENGTH                    0x00000001

#define _IFS1_U2RXIF_POSITION                    0x00000008
#define _IFS1_U2RXIF_MASK                        0x00000100
#define _IFS1_U2RXIF_LENGTH                      0x00000001

#define _IFS1_U2TXIF_POSITION                    0x00000009
#define _IFS1_U2TXIF_MASK                        0x00000200
#define _IFS1_U2TXIF_LENGTH                      0x00000001

#define _IFS1_U2EIF_POSITION                     0x0000000A
#define _IFS1_U2EIF_MASK                         0x00000400
#define _IFS1_U2EIF_LENGTH                       0x00000001

#define _IFS1_I2C2SIF_POSITION                   0x0000000B
#define _IFS1_I2C2SIF_MASK                       0x00000800
#define _IFS1_I2C2SIF_LENGTH                     0x00000001

#define _IFS1_I2C2MIF_POSITION                   0x0000000C
#define _IFS1_I2C2MIF_MASK                       0x00001000
#define _IFS1_I2C2MIF_LENGTH                     0x00000001

#define _IFS1_I2C2BCIF_POSITION                  0x0000000D
#define _IFS1_I2C2BCIF_MASK                      0x00002000
#define _IFS1_I2C2BCIF_LENGTH                    0x00000001

#define _IFS1_NVMIF_POSITION                     0x0000000E
#define _IFS1_NVMIF_MASK                         0x00004000
#define _IFS1_NVMIF_LENGTH                       0x00000001

#define _IFS1_CPCIF_POSITION                     0x0000000F
#define _IFS1_CPCIF_MASK                         0x00008000
#define _IFS1_CPCIF_LENGTH                       0x00000001

#define _IFS1_ECCSBEIF_POSITION                  0x00000011
#define _IFS1_ECCSBEIF_MASK                      0x00020000
#define _IFS1_ECCSBEIF_LENGTH                    0x00000001

#define _IFS1_w_POSITION                         0x00000000
#define _IFS1_w_MASK                             0xFFFFFFFF
#define _IFS1_w_LENGTH                           0x00000020

#define _IEC0_CTIE_POSITION                      0x00000000
#define _IEC0_CTIE_MASK                          0x00000001
#define _IEC0_CTIE_LENGTH                        0x00000001

#define _IEC0_CS0IE_POSITION                     0x00000001
#define _IEC0_CS0IE_MASK                         0x00000002
#define _IEC0_CS0IE_LENGTH                       0x00000001

#define _IEC0_CS1IE_POSITION                     0x00000002
#define _IEC0_CS1IE_MASK                         0x00000004
#define _IEC0_CS1IE_LENGTH                       0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000003
#define _IEC0_INT0IE_MASK                        0x00000008
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_INT1IE_POSITION                    0x00000004
#define _IEC0_INT1IE_MASK                        0x00000010
#define _IEC0_INT1IE_LENGTH                      0x00000001

#define _IEC0_INT2IE_POSITION                    0x00000005
#define _IEC0_INT2IE_MASK                        0x00000020
#define _IEC0_INT2IE_LENGTH                      0x00000001

#define _IEC0_INT3IE_POSITION                    0x00000006
#define _IEC0_INT3IE_MASK                        0x00000040
#define _IEC0_INT3IE_LENGTH                      0x00000001

#define _IEC0_INT4IE_POSITION                    0x00000007
#define _IEC0_INT4IE_MASK                        0x00000080
#define _IEC0_INT4IE_LENGTH                      0x00000001

#define _IEC0_CNAIE_POSITION                     0x00000008
#define _IEC0_CNAIE_MASK                         0x00000100
#define _IEC0_CNAIE_LENGTH                       0x00000001

#define _IEC0_CNBIE_POSITION                     0x00000009
#define _IEC0_CNBIE_MASK                         0x00000200
#define _IEC0_CNBIE_LENGTH                       0x00000001

#define _IEC0_CNCIE_POSITION                     0x0000000A
#define _IEC0_CNCIE_MASK                         0x00000400
#define _IEC0_CNCIE_LENGTH                       0x00000001

#define _IEC0_T1IE_POSITION                      0x0000000B
#define _IEC0_T1IE_MASK                          0x00000800
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_CMP1IE_POSITION                    0x0000000C
#define _IEC0_CMP1IE_MASK                        0x00001000
#define _IEC0_CMP1IE_LENGTH                      0x00000001

#define _IEC0_CMP2IE_POSITION                    0x0000000D
#define _IEC0_CMP2IE_MASK                        0x00002000
#define _IEC0_CMP2IE_LENGTH                      0x00000001

