codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0032gpl036.h
#define _IEC0_RTCCIE_POSITION                    0x0000000E
#define _IEC0_RTCCIE_MASK                        0x00004000
#define _IEC0_RTCCIE_LENGTH                      0x00000001

#define _IEC0_AD1IE_POSITION                     0x0000000F
#define _IEC0_AD1IE_MASK                         0x00008000
#define _IEC0_AD1IE_LENGTH                       0x00000001

#define _IEC0_CRCIE_POSITION                     0x00000010
#define _IEC0_CRCIE_MASK                         0x00010000
#define _IEC0_CRCIE_LENGTH                       0x00000001

#define _IEC0_LVDIE_POSITION                     0x00000011
#define _IEC0_LVDIE_MASK                         0x00020000
#define _IEC0_LVDIE_LENGTH                       0x00000001

#define _IEC0_CLC1IE_POSITION                    0x00000012
#define _IEC0_CLC1IE_MASK                        0x00040000
#define _IEC0_CLC1IE_LENGTH                      0x00000001

#define _IEC0_CLC2IE_POSITION                    0x00000013
#define _IEC0_CLC2IE_MASK                        0x00080000
#define _IEC0_CLC2IE_LENGTH                      0x00000001

#define _IEC0_SPI1EIE_POSITION                   0x00000014
#define _IEC0_SPI1EIE_MASK                       0x00100000
#define _IEC0_SPI1EIE_LENGTH                     0x00000001

#define _IEC0_SPI1TXIE_POSITION                  0x00000015
#define _IEC0_SPI1TXIE_MASK                      0x00200000
#define _IEC0_SPI1TXIE_LENGTH                    0x00000001

#define _IEC0_SPI1RXIE_POSITION                  0x00000016
#define _IEC0_SPI1RXIE_MASK                      0x00400000
#define _IEC0_SPI1RXIE_LENGTH                    0x00000001

#define _IEC0_U1RXIE_POSITION                    0x00000017
#define _IEC0_U1RXIE_MASK                        0x00800000
#define _IEC0_U1RXIE_LENGTH                      0x00000001

#define _IEC0_U1TXIE_POSITION                    0x00000018
#define _IEC0_U1TXIE_MASK                        0x01000000
#define _IEC0_U1TXIE_LENGTH                      0x00000001

#define _IEC0_U1EIE_POSITION                     0x00000019
#define _IEC0_U1EIE_MASK                         0x02000000
#define _IEC0_U1EIE_LENGTH                       0x00000001

#define _IEC0_I2C1SIE_POSITION                   0x0000001A
#define _IEC0_I2C1SIE_MASK                       0x04000000
#define _IEC0_I2C1SIE_LENGTH                     0x00000001

#define _IEC0_I2C1MIE_POSITION                   0x0000001B
#define _IEC0_I2C1MIE_MASK                       0x08000000
#define _IEC0_I2C1MIE_LENGTH                     0x00000001

#define _IEC0_I2CBCIE_POSITION                   0x0000001C
#define _IEC0_I2CBCIE_MASK                       0x10000000
#define _IEC0_I2CBCIE_LENGTH                     0x00000001

#define _IEC0_CCP1IE_POSITION                    0x0000001D
#define _IEC0_CCP1IE_MASK                        0x20000000
#define _IEC0_CCP1IE_LENGTH                      0x00000001

#define _IEC0_CCT1IE_POSITION                    0x0000001E
#define _IEC0_CCT1IE_MASK                        0x40000000
#define _IEC0_CCT1IE_LENGTH                      0x00000001

#define _IEC0_CCP2IE_POSITION                    0x0000001F
#define _IEC0_CCP2IE_MASK                        0x80000000
#define _IEC0_CCP2IE_LENGTH                      0x00000001

#define _IEC0_w_POSITION                         0x00000000
#define _IEC0_w_MASK                             0xFFFFFFFF
#define _IEC0_w_LENGTH                           0x00000020

#define _IEC1_CCT2IE_POSITION                    0x00000000
#define _IEC1_CCT2IE_MASK                        0x00000001
#define _IEC1_CCT2IE_LENGTH                      0x00000001

#define _IEC1_CCP3IE_POSITION                    0x00000001
#define _IEC1_CCP3IE_MASK                        0x00000002
#define _IEC1_CCP3IE_LENGTH                      0x00000001

#define _IEC1_CCT3IE_POSITION                    0x00000002
#define _IEC1_CCT3IE_MASK                        0x00000004
#define _IEC1_CCT3IE_LENGTH                      0x00000001

#define _IEC1_SPI2EIE_POSITION                   0x00000005
#define _IEC1_SPI2EIE_MASK                       0x00000020
#define _IEC1_SPI2EIE_LENGTH                     0x00000001

#define _IEC1_SPI2TXIE_POSITION                  0x00000006
#define _IEC1_SPI2TXIE_MASK                      0x00000040
#define _IEC1_SPI2TXIE_LENGTH                    0x00000001

#define _IEC1_SPI2RXIE_POSITION                  0x00000007
#define _IEC1_SPI2RXIE_MASK                      0x00000080
#define _IEC1_SPI2RXIE_LENGTH                    0x00000001

#define _IEC1_U2RXIE_POSITION                    0x00000008
#define _IEC1_U2RXIE_MASK                        0x00000100
#define _IEC1_U2RXIE_LENGTH                      0x00000001

#define _IEC1_U2TXIE_POSITION                    0x00000009
#define _IEC1_U2TXIE_MASK                        0x00000200
#define _IEC1_U2TXIE_LENGTH                      0x00000001

#define _IEC1_U2EIE_POSITION                     0x0000000A
#define _IEC1_U2EIE_MASK                         0x00000400
#define _IEC1_U2EIE_LENGTH                       0x00000001

#define _IEC1_I2C2SIE_POSITION                   0x0000000B
#define _IEC1_I2C2SIE_MASK                       0x00000800
#define _IEC1_I2C2SIE_LENGTH                     0x00000001

#define _IEC1_I2C2MIE_POSITION                   0x0000000C
#define _IEC1_I2C2MIE_MASK                       0x00001000
#define _IEC1_I2C2MIE_LENGTH                     0x00000001

#define _IEC1_I2C2BCIE_POSITION                  0x0000000D
#define _IEC1_I2C2BCIE_MASK                      0x00002000
#define _IEC1_I2C2BCIE_LENGTH                    0x00000001

#define _IEC1_NVMIE_POSITION                     0x0000000E
#define _IEC1_NVMIE_MASK                         0x00004000
#define _IEC1_NVMIE_LENGTH                       0x00000001

#define _IEC1_CPCIE_POSITION                     0x0000000F
#define _IEC1_CPCIE_MASK                         0x00008000
#define _IEC1_CPCIE_LENGTH                       0x00000001

#define _IEC1_ECCSBEIE_POSITION                  0x00000011
#define _IEC1_ECCSBEIE_MASK                      0x00020000
#define _IEC1_ECCSBEIE_LENGTH                    0x00000001

#define _IEC1_w_POSITION                         0x00000000
#define _IEC1_w_MASK                             0xFFFFFFFF
#define _IEC1_w_LENGTH                           0x00000020

#define _IPC0_CTIS_POSITION                      0x00000000
#define _IPC0_CTIS_MASK                          0x00000003
#define _IPC0_CTIS_LENGTH                        0x00000002

